<a href="https://colab.research.google.com/github/gotjd709/DataEngineer/blob/master/week1_monthly_active_user.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### 주피터 SQL 엔진 설정

jupyter notebook에서 ipython-sql로 DB 접속하기 위한 설정

In [1]:
%load_ext sql

관계형데이터베이스(RDBMS) 중 하나인 PostgreSQL에 접속 \

RDBMS 종류 \
- SQL Server
- My SQL
- PostgreSQL

In [2]:
%sql postgresql://myid:mdpw@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:port/dev

user_session_channel 테이블 구조 파악

In [3]:
%%sql SELECT *
FROM raw_data.user_session_channel
LIMIT 10;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(1651, '0004289ee1c7b8b08c77e19878106ae3', 'Organic'),
 (1197, '00053f5e11d1fe4e49a221165b39abc9', 'Facebook'),
 (1401, '00056c20eb5a029583db75506953f1d9', 'Facebook'),
 (1399, '00063cb5da1826febf178b669eea3250', 'Facebook'),
 (1667, '000958fdaefe0dd06f5d7c4e4a5f28d1', 'Instagram'),
 (468, '000a3f777828d2cdbee98887561aa130', 'Facebook'),
 (1563, '000cb7efa8a05429dd5309b4bea2eb0c', 'Naver'),
 (711, '00106ac9184e7d54b570d0f0cb0c38b2', 'Organic'),
 (473, '0011df6282fe8cf78feeab676fbc3c27', 'Naver'),
 (420, '00126b47d5502dfb7d01f750ad23d813', 'Facebook')]

session_timestamp 테이블 구조 파악

In [4]:
%%sql

SELECT *
FROM raw_data.session_timestamp
LIMIT 10;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[('0002ac0d783338cfeab0b2bdbd872cda', datetime.datetime(2019, 7, 29, 12, 39, 41, 817000)),
 ('00053f5e11d1fe4e49a221165b39abc9', datetime.datetime(2019, 6, 24, 13, 4, 26, 370000)),
 ('00056c20eb5a029583db75506953f1d9', datetime.datetime(2019, 9, 26, 14, 50, 17)),
 ('00063cb5da1826febf178b669eea3250', datetime.datetime(2019, 10, 16, 14, 4, 42, 797000)),
 ('0007cda84fafdcf42f96c4f4adb7f8ce', datetime.datetime(2019, 5, 22, 8, 2, 29, 360000)),
 ('000c076c390a4c357313fca29e390ece', datetime.datetime(2019, 5, 2, 15, 24, 33, 963000)),
 ('000dd3543ac84d906eae52e7c779bb2a', datetime.datetime(2019, 8, 13, 15, 27, 51, 850000)),
 ('00106ac9184e7d54b570d0f0cb0c38b2', datetime.datetime(2019, 7, 25, 18, 14, 43, 37000)),
 ('0011df6282fe8cf78feeab676fbc3c27', datetime.datetime(2019, 11, 2, 21, 10, 41)),
 ('00126b47d5502dfb7d01f750ad23d813', datetime.datetime(2019, 6, 15, 15, 35, 48, 483000))]

후보키는 sessionsID 하나이므로 기본키로 선택하여 두 테이블을 조인하여 확인

In [5]:
%%sql

SELECT *
FROM raw_data.session_timestamp as st
    JOIN raw_data.user_session_channel as usc
ON st.sessionID = usc.sessionID
LIMIT 10;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[('00029153d12ae1c9abe59c17ff2e0895', datetime.datetime(2019, 10, 18, 14, 14, 5, 100000), 1491, '00029153d12ae1c9abe59c17ff2e0895', 'Organic'),
 ('0002ac0d783338cfeab0b2bdbd872cda', datetime.datetime(2019, 7, 29, 12, 39, 41, 817000), 59, '0002ac0d783338cfeab0b2bdbd872cda', 'Naver'),
 ('0006246bee639c7a7b11a08e34dd3cc6', datetime.datetime(2019, 8, 10, 16, 33, 14, 980000), 117, '0006246bee639c7a7b11a08e34dd3cc6', 'Youtube'),
 ('0006dd05ea1e999ddaa041a7091b7b36', datetime.datetime(2019, 7, 6, 19, 54, 15, 83000), 572, '0006dd05ea1e999ddaa041a7091b7b36', 'Organic'),
 ('0007cda84fafdcf42f96c4f4adb7f8ce', datetime.datetime(2019, 5, 22, 8, 2, 29, 360000), 935, '0007cda84fafdcf42f96c4f4adb7f8ce', 'Google'),
 ('000a91f3e374e6147d58ed1814247508', datetime.datetime(2019, 7, 17, 14, 24, 16, 880000), 1363, '000a91f3e374e6147d58ed1814247508', 'Naver'),
 ('000c076c390a4c357313fca29e390ece', datetime.datetime(2019, 5, 2, 15, 24, 33, 963000), 780, '000c076c390a4c357313fca29e390ece', 'Naver'),
 ('000d0c74074191add6f22e0004db8f76', datetime.datetime(2019, 8, 21, 14, 48, 36), 1917, '000d0c74074191add6f22e0004db8f76', 'Organic'),
 ('000d54aadcedee0739d39127955f2cdb', datetime.datetime(2019, 9, 21, 21, 16, 29), 1357, '000d54aadcedee0739d39127955f2cdb', 'Instagram'),
 ('000dd3543ac84d906eae52e7c779bb2a', datetime.datetime(2019, 8, 13, 15, 27, 51, 850000), 1247, '000dd3543ac84d906eae52e7c779bb2a', 'Naver')]

고려사항
- 같은 사용자가 다른 세션으로 들어올 수 있으므로 사용자 수를 카운트해야 함
- 월별로 계산해야 하므로 타임스탬프의 단위를 변환해주어야 함. 이때, 여러 연도에서 수집되었을 수 있으니 확인.

In [6]:
%%sql

SELECT extract(year from st.ts) as year
FROM raw_data.session_timestamp as st
    JOIN raw_data.user_session_channel as usc
ON st.sessionID = usc.sessionID
GROUP BY 1;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(2019,)]

2019년에만 해당하는 코드이므로 연도를 고려하지 않고 월별만 고려하여 처리

### 최종제출코드

In [7]:
%%sql

SELECT extract(month from st.ts) as month, count(DISTINCT usc.userID)
FROM raw_data.session_timestamp as st
    JOIN raw_data.user_session_channel as usc
ON st.sessionID = usc.sessionID
GROUP BY 1
ORDER BY month asc;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
7 rows affected.

[(5, 281), (6, 459), (7, 623), (8, 662), (9, 639), (10, 763), (11, 721)]